CSI API ETABS v1

# eItemTypeElm Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eItemTypeElm

    Public Enumeration eItemTypeElm

    Dim instance As eItemTypeElm

    public enum class eItemTypeElm

    type eItemTypeElm

Members

| Member name| Value| Description
---|---|---|---
| ObjectElm| 0|
| Element| 1|
| GroupElm| 2|
| SelectionElm| 3|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com